REGIONS = {
    "SA": "Республика Саха",
    "KHA": "Хабаровский край",
    "PRI": "Приморский край",
    "AMU": "Амурская область",
    "MAG": "Магаданская область",
    "SAK": "Сахалинская область",
    "CHU": "Чукотский автономный округ",
    "KAM": "Камчатский край",
    "YEV": "Еврейская автономная область",
    "BU": "Республика Бурятия",
    "ZAB": "Забайкальский край",
}

CITIES = [
    ('BLG', 'Благовещенск'),
    ('BEL', 'Белогорск'),
    ('SVO', 'Свободный'),
    ('TYN', 'Тында'),
    ('ZEY', 'Зея'),
    ('SHI', 'Шимановск'),
    ('RAY', 'Райчихинск'),
    ('ZAV', 'Завитинск'),
    ('SKO', 'Сковородино'),
    ('ULU', 'Улан-Удэ'),
    ('SEV', 'Северобайкальск'),
    ('GUS', 'Гусиноозёрск'),
    ('KYA', 'Кяхта'),
    ('ZAK', 'Закаменск'),
    ('BAB', 'Бабушкин'),
    ('BIR', 'Биробиджан'),
    ('OBL', 'Облучье'),
    ('CHI', 'Чита'),
    ('KRK', 'Краснокаменск'),
    ('BOR', 'Борзя'),
    ('PTZ', 'Петровск-Забайкальский'),
    ('NER', 'Нерчинск'),
    ('MOG', 'Могоча'),
    ('SHL', 'Шилка'),
    ('BAL', 'Балей'),
    ('HIL', 'Хилок'),
    ('SRE', 'Сретенск'),
    ('PTK', 'Петропавловск-Камчатский'),
    ('ELZ', 'Елизово'),
    ('VIL', 'Вилючинск'),
    ('MAG', 'Магадан'),
    ('SUS', 'Сусуман'),
    ('VLA', 'Владивосток'),
    ('USS', 'Уссурийск'),
    ('NAH', 'Находка'),
    ('ART', 'Артём'),
    ('ARS', 'Арсеньев'),
    ('SPA', 'Спасск-Дальний'),
    ('BKA', 'Большой Камень'),
    ('PAR', 'Партизанск'),
    ('LES', 'Лесозаводск'),
    ('DLG', 'Дальнегорск'),
    ('DLR', 'Дальнереченск'),
    ('FOK', 'Фокино'),
    ('YAK', 'Якутск'),
    ('NYU', 'Нерюнгри'),
    ('MIR', 'Мирный'),
    ('LEN', 'Ленск'),
    ('UDC', 'Удачный'),
    ('VLY', 'Вилюйск'),
    ('NYR', 'Нюрба'),
    ('POK', 'Покровск'),
    ('OLE', 'Олёкминск'),
    ('TOM', 'Томмот'),
    ('SRK', 'Среднеколымск'),
    ('VER', 'Верхоянск'),
    ('YUS', 'Южно-Сахалинск'),
    ('KOR', 'Корсаков'),
    ('KHM', 'Холмск'),
    ('OHA', 'Оха'),
    ('POR', 'Поронайск'),
    ('DOL', 'Долинск'),
    ('NEV', 'Невельск'),
    ('ANV', 'Анива'),
    ('ALS', 'Александровск-Сахалинский'),
    ('UGL', 'Углегорск'),
    ('SHA', 'Шахтёрск'),
    ('MAK', 'Макаров'),
    ('TMR', 'Томари'),
    ('SKU', 'Северо-Курильск'),
    ('KUR', 'Курильск'),
    ('KHA', 'Хабаровск'),
    ('KOM', 'Комсомольск-на-Амуре'),
    ('AMU', 'Амурск'),
    ('SGA', 'Советская Гавань'),
    ('NIK', 'Николаевск-на-Амуре'),
    ('BIK', 'Бикин'),
    ('VYA', 'Вяземский'),
    ('ANA', 'Анадырь'),
    ('BIL', 'Билибино'),
    ('PEV', 'Певек'),
]

LINKED = {
    'SA':
        [
            'Якутск', 'Нерюнгри', 'Мирный', 'Ленск', 'Удачный', 'Вилюйск', 'Нюрба', 'Покровск',
            'Олёкминск', 'Томмот', 'Среднеколымск', 'Верхоянск'
        ],
    'KHA':
        [
            'Хабаровск', 'Комсомольск-на-Амуре', 'Амурск', 'Советская Гавань', 'Николаевск-на-Амуре', 'Бикин', 'Вяземский'
        ],
    'PRI':
        [
            'Владивосток', 'Уссурийск', 'Находка', 'Артём', 'Арсеньев', 'Спасск-Дальний', 'Большой Камень',
            'Партизанск', 'Лесозаводск', 'Дальнегорск', 'Дальнереченск', 'Фокино'
        ],
    'AMU':
        [
            'Благовещенск', 'Белогорск', 'Свободный', 'Тында', 'Зея', 'Шимановск', 'Райчихинск', 'Завитинск', 'Сковородино'
        ],
    'MAG': [
        'Магадан', 'Сусуман'
        ],
    'SAK':
        [
            'Южно-Сахалинск', 'Корсаков', 'Холмск', 'Оха', 'Поронайск', 'Долинск', 'Невельск', 'Анива',
            'Александровск-Сахалинский', 'Углегорск', 'Шахтёрск', 'Макаров', 'Томари', 'Северо-Курильск', 'Курильск'
        ],
    'CHU':
        [
            'Анадырь', 'Билибино', 'Певек'
        ],
    'KAM':
        [
            'Петропавловск-Камчатский', 'Елизово', 'Вилючинск'
        ],
    'YEV':
        [
            'Биробиджан', 'Облучье'
        ],
    'BU':
        [
            'Улан-Удэ', 'Северобайкальск', 'Гусиноозёрск', 'Кяхта', 'Закаменск', 'Бабушкин'
        ],
    'ZAB':
        [
            'Чита', 'Краснокаменск', 'Борзя', 'Петровск-Забайкальский',
            'Нерчинск', 'Могоча', 'Шилка', 'Балей', 'Хилок', 'Сретенск'
        ]
}